fix lab 9 10
